quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
					//--------------------------LED指示灯
					ampsys.CommLed.flag.cb_tx	=	1;
					ampsys.CommLed.time.cb_tx	=	ampledtime;
					
					//----------------------------------------------广播数据只发两次，不需要应答
					if(0xFF==frame->msg.addr.address1)	//广播地址
					{
						if(ampsys.Cab.ReSendCount>=2)
						{
							ampsys.Cab.ReSendCount=0;
							del_cache_data(CabPort);
							del_ack_wait_flag(CabPort);			//0--无需等待应答，1--需等待应答
						}
					}
					else
					{
						set_ack_wait_flag(CabPort);			//0--无需等待应答，1--需等待应答
					}
				}
			}
		}
	}		
}
//------------------------------------------------------------------------------
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void lay_receive_data_process(void)
{  
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
	unsigned short 	rxnum=0;
	
	ampphydef* frame;
	unsigned char 	rxd[maxFramesize];
	//============================数据接收
	rxnum	=	api_rs485_dma_receive(&ampRS485Ly,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	//============================接收处理
	if(0!=rxnum)
	{

		frame	=	api_get_frame(rxd,rxnum);
		//--------------------------有效数据
		if(0!=frame)
		{
			//------------------------LED指示灯
			ampsys.CommLed.flag.ly_rx	=	1;
			ampsys.CommLed.time.ly_rx	=	ampledtime;
			
			cmd	=	frame->msg.cmd.cmd;
			dir	=	frame->msg.cmd.dir;
			//------------------------检查数据传输方向，层接口只接收上传
			if(0!=dir)	//下级上传消息
			{
				//----------------------检查是否为应答
				if(ampCmdAck==cmd)			//应答，删除一缓存
				{	
					//--------------------应答
					unsigned char wait_ack	=	get_ack_wait_flag(LayPort);
					if(wait_ack)
					{
						ampsys.Lay.ReSendCount	=	0;
						ampsys.Lay.SendWaitTime	=	2;
						del_cache_data(LayPort);
						del_ack_wait_flag(LayPort);
					}
				}
				//----------------------应答主柜数据转发到PC
				else
				{
					if(ampsys.sysdata.MB_Flag)	//主柜
					{
						set_cache_data(PcPort,frame);			//发往PC缓存						
					}
					else
					{
						set_cache_data(CabPort,frame);
					}
					//--------------------应答
					set_ackdown_frame(LayPort);
				}
			}
		}
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void lay_send_data_process(void)
{	
	unsigned short sendnum=0;
	ampCachedef*	Cache;
	ampphydef* frame;
	//============================等待发送时间已到
	if(0==ampsys.Lay.SendWaitTime)
	{
		//==========================检查有无应答数据要发送
		if(ampsys.Lay.AckFrame.flag)
		{
			unsigned char* addr	=	&ampsys.Lay.AckFrame.head;
			sendnum	=	api_rs485_dma_send(&ampRS485Ly,addr,ampAckSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
			if(sendnum)	//已将数据转移到缓存
			{	
				ampsys.Lay.AckFrame.flag	=	0;
				del_ack_wait_flag(LayPort);
				ampsys.Lay.SendWaitTime		=	10;
			}
		}
		//==========================检查有无发送超时
		else if(ampsys.Lay.ReSendCount>=ampMaxResendCount)
		{			
			Cache	=	get_cache_data(LayPort);
			if(0!=Cache)	//有数据
			{
				frame	=	(ampphydef*)Cache->data;
				ampsys.Lay.ReSendCount	=	0;			
				if(ampsys.sysdata.MB_Flag)	//主柜
				{
					set_comm_time_out_frame(PcPort,frame);
				}
				else
				{
					set_comm_time_out_frame(CabPort,frame);
				}
				del_cache_data(LayPort);
			}
		}
		//==========================检查有无待发送数据
		else
		{
			//------------------------发送数据：广播数据只发两次
			Cache	=	get_cache_data(LayPort);
			if(0==Cache)	//无数据
			{
				ampsys.Lay.ReSendCount	=	0;
				ampsys.Lay.SendWaitTime		=	5;
			}
			else
			{
				//----------------------
				sendnum	=	api_rs485_dma_send(&ampRS485Ly,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
				if(sendnum)	//已将数据转移到缓存
				{	
					frame	=	(ampphydef*)Cache->data;		
					ampsys.Lay.ReSendCount+=1;			
					ampsys.Lay.SendWaitTime	=	ampReSendTime;
					
					//----------------------LED指示灯
					ampsys.CommLed.flag.ly_tx	=	1;
					ampsys.CommLed.time.ly_tx	=	ampledtime;
					
					//----------------------广播数据只发两次，不需要应答
					if((0xFF==frame->msg.addr.address2)||(0xFF==frame->msg.addr.address3))	//广播地址
					{
						if(ampsys.Lay.ReSendCount>=2)
						{
							ampsys.Lay.ReSendCount=0;
							del_cache_data(LayPort);
							del_ack_wait_flag(LayPort);			//0--无需等待应答，1--需等待应答
						}
					}
					else
					{
						set_ack_wait_flag(LayPort);				//0--无需等待应答，1--需等待应答
					}
				}
			}
		}
	}	
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cmd_process(ampphydef* frame)
{	
	if(0!=frame)
	{	
		unsigned char	cab_addr	=	0;	//柜地址
		unsigned char cmd				=	0;
		unsigned char parameter	=	0;
		cmd	=	frame->msg.cmd.cmd;
		cab_addr		=	frame->msg.addr.address1;		//柜地址
		parameter		=	frame->msg.data[0];					//如果是控制类消息时的请求标志
		
		if((0xFF==cab_addr)||(cab_addr==ampsys.sysdata.Cab_Addr))	//地址
		{
			//------------------------------与层板供电相关的命令1
			if((ampCmdLcdConf == cmd)||(ampCmdLcdData==cmd))       //LCD配置命令
			{
				set_layer_power(1);
			}
			
			//------------------------------与层板供电相关的命令2
			if((ampCmdLed==cmd)||(ampCmdLcdPwr==cmd)||(ampCmdPwr==cmd))  //LED电源供电控制指令
			{
				set_layer_power(parameter);
			}
			
			//------------------------------与背光相关的命令
			if((ampCmdLed==cmd)||(ampCmdLcdPwr==cmd)||(ampCmdPwr==cmd)||(ampCmdBKligth==cmd))  //LED电源供电控制指令
			{
				ampsys.BackLight.flag.Level=3;
				ampsys.LcdLight.flag.Level=3;
			}

			//------------------------------与开门相关的命令
			if(ampCmdLock ==  cmd)   //锁控制命令
			{
				set_door(parameter);
			}
			//------------------------------查询命令
			else if(ampCmdSta ==  cmd)   //查询状态
			{
				set_lock_status_frame();
			}
		}
	}
}
//------------------------------------------------------------------------------


