quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
		//------透明屏标志
		if(id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
		unsigned char new_id  = 0;
		new_id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id != new_id)  //重新初始化
		{
			ampsys.sysdata.Cab_Addr	=	new_id&0x3F;	

			if(new_id&0x80)
				ampsys.sysdata.MB_Flag	=	1;
			else
				ampsys.sysdata.MB_Flag	=	0;
			//------透明屏标志
		if(new_id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		
//			power_on_flag = 0;
			id = new_id;
		}
		
  }
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void door_server(void)
{
	//============================
	if(ampsys.Lock.LockTime>0)
	{
		if(ampsys.Lock.LockTime<ampUnlockOuttime-100)
		{
			if(ampGetLockSts)			//锁未打开
			{
				ampUnLock;
			}
			else if(ampsys.Lock.LockTime>200)
			{
				ampsys.Lock.LockTime	=	200-1;	//延迟500ms释放锁
			}
		}
		else
		{
			ampUnLock;
		}
	}
	//============================
	else
	{
		ampResLock;
		//--------------------------门状态--关闭
		if(ampGetLockSts)
		{
			if(0==ampsys.Lock.flag.LockStatus)	//原来为开门状态
			{
				ampsys.BackLight.flag.Level=3;
				ampsys.BackLight.flag.Level=3;
				ampsys.LcdLight.flag.Level=3;
				set_layer_power(0);				//关层板电源
				set_lock_status_frame();	//上报关门消息
			}
			else
			{
			}			
			ampsys.Lock.flag.LockStatus	=	1;
		}
		//--------------------------门状态--打开
		else
		{
			if(0!=ampsys.Lock.flag.LockStatus)	//原来为关门状态
			{
				ampsys.BackLight.flag.Level=2;
				ampsys.LcdLight.flag.Level=1;
				set_lock_status_frame();
			}
			else
			{
			}
			ampsys.Lock.flag.LockStatus	=	0;
		}		
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Server(void)
{
	unsigned char displaycode	=	0;
  static unsigned short freshen_led_time=0;
  if(freshen_led_time++>100)
  {
		freshen_led_time	=	0;
		
		displaycode	=	ampsys.CommLed.display;
		displaycode	=	displaycode^0xFF;
		
		ampsys.CommLed.display	=	displaycode;
		if(ampsys.CommLed.time.rf_rx>0)
		{
			ampsys.CommLed.time.rf_rx-=1;
		}
		else
		{
			displaycode|=0x80;
		}
		if(ampsys.CommLed.time.rf_tx>0)
		{
			ampsys.CommLed.time.rf_tx-=1;
		}
		else
		{
			displaycode|=0x40;
		}
		//--------------------------------
		if(ampsys.CommLed.time.ly_rx>0)
		{
			ampsys.CommLed.time.ly_rx-=1;
		}
		else
		{
			displaycode|=0x20;
		}
		if(ampsys.CommLed.time.ly_tx>0)
		{
			ampsys.CommLed.time.ly_tx-=1;
		}
		else
		{
			displaycode|=0x10;
		}
		//--------------------------------
		if(ampsys.CommLed.time.cb_rx>0)
		{
			ampsys.CommLed.time.cb_rx-=1;
		}
		else
		{
			displaycode|=0x08;
		}
		if(ampsys.CommLed.time.cb_tx>0)
		{
			ampsys.CommLed.time.cb_tx-=1;
		}
		else
		{
			displaycode|=0x04;
		}
		//--------------------------------
		if(ampsys.CommLed.time.pc_rx>0)
		{
			ampsys.CommLed.time.pc_rx-=1;
		}
		else
		{
			displaycode|=0x02;
		}
		if(ampsys.CommLed.time.pc_tx>0)
		{
			ampsys.CommLed.time.pc_tx-=1;
		}
		else
		{
			displaycode|=0x01;
		}
		
		//____________使能片选
		spi_set_nss_low(&stLed);
		SPI_I2S_SendData(stLed.port.SPIx, displaycode);				//发送数据
//    SPI_ReadWriteByteSPI(&stLed,led_stata);
		//____________取消片选	
		spi_set_nss_high(&stLed);
  }  
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Server(void)
{
	//#define ampBackLightOff		PWM_OUT(TIM3,PWM_OUTChannel3,500,10)	//PWM设定-20161127版本	占空比1/1000
	//#define ampBackLightOn		PWM_OUT(TIM3,PWM_OUTChannel3,500,990)	//PWM设定-20161127版本	占空比1/1000
	//============================最低亮度/灭灯，计时或者需要灭灯时请求，开门时LCD背光亮度
	if(1==ampsys.BackLight.flag.Level)
	{
		PWM_OUT(TIM3,PWM_OUTChannel3,300,1);
		ampsys.BackLight.Time							=	0;
	}
	//============================中等亮度，开门时柜体背光亮度
	else if(2==ampsys.BackLight.flag.Level)
	{
		PWM_OUT(TIM3,PWM_OUTChannel3,300,500);
		ampsys.BackLight.flag.LightStatus	=	0;
		ampsys.BackLight.Time							=	0;
	}
	//============================最高亮度，关门时需要亮灯时的亮度
	else if(3==ampsys.BackLight.flag.Level)
	{
		PWM_OUT(TIM3,PWM_OUTChannel3,300,999);
		ampsys.BackLight.Time							=	BackLightOnTime;
	}
	else
	{
		if(ampsys.BackLight.Time)
		{
			ampsys.BackLight.Time--;
			ampsys.BackLight.flag.LightStatus=1;
		}
		//============================灭灯
		else if(0!=ampsys.BackLight.flag.LightStatus)
		{
			ampsys.BackLight.flag.LightStatus=0;
			PWM_OUT(TIM3,PWM_OUTChannel3,300,1);
		}
	}
	ampsys.BackLight.flag.Level				=	0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void LcdLight_Server(void)
{
	//#define ampLcdLightOff	PWM_OUTN(TIM1,PWM_OUTChannel2,500,1000)	//PWM设定-20161127版本	占空比1/1000
	//#define ampLcdLightOn		PWM_OUTN(TIM1,PWM_OUTChannel2,500,0)		//PWM设定-20161127版本	占空比1/1000
	
	//============================最低亮度/灭灯，计时或者需要灭灯时请求，开门时LCD背光亮度
	if(1==ampsys.LcdLight.flag.Level)
	{
		PWM_OUTN(TIM1,PWM_OUTChannel2,300,999);
		ampsys.LcdLight.Time							=	0;
	}
	//============================中等亮度，开门时柜体背光亮度
	else if(2==ampsys.LcdLight.flag.Level)
	{
		PWM_OUTN(TIM1,PWM_OUTChannel2,300,500);
		ampsys.LcdLight.flag.LightStatus	=	0;
		ampsys.LcdLight.Time							=	0;
	}
	//============================最高亮度，关门时需要亮灯时的亮度
	else if(3==ampsys.LcdLight.flag.Level)
	{
		PWM_OUTN(TIM1,PWM_OUTChannel2,300,1);
		ampsys.LcdLight.Time							=	LcdLightOnTime;
	}
	else
	{
		if(ampsys.LcdLight.Time)
		{
			ampsys.LcdLight.Time--;
			ampsys.LcdLight.flag.LightStatus	=1;
		}
		//============================灭灯
		else if(0!=ampsys.LcdLight.flag.LightStatus)
		{
			ampsys.LcdLight.flag.LightStatus=0;
			PWM_OUTN(TIM1,PWM_OUTChannel2,300,999);
		}
	}
	ampsys.LcdLight.flag.Level				=	0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Tim_Server(void)
{
  //----------------PC发送
  if(ampsys.Pc.SendWaitTime>0)
  {
    ampsys.Pc.SendWaitTime--;
  }
  //----------------柜发送
  if(ampsys.Cab.SendWaitTime>0)
  {
    ampsys.Cab.SendWaitTime--;
  }
  //----------------层发送
  if(ampsys.Lay.SendWaitTime>0)
  {
    ampsys.Lay.SendWaitTime--;
  }
  //----------------读卡器发送
  if(ampsys.time.CardSendTime>0)
  {
    ampsys.time.CardSendTime--;
  }
  //----------------锁
  if(ampsys.Lock.LockTime>0)
  {
    ampsys.Lock.LockTime--;
  }
  //----------------拨码
  if(ampsys.time.swicthidtime>0)
  {
    ampsys.time.swicthidtime--;
  }
  //----------------运行指示灯
  if(ampsys.time.SYSLEDTime>0)
  {
    ampsys.time.SYSLEDTime--;
  }
	//----------------运行指示灯
  if(ampsys.time.BackLightTime>0)
  {
    ampsys.time.BackLightTime--;
  }	
}
//------------------------------------------------------------------------------







//--------------------------------static-configuration
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Hardware_Configuration(void)
{
  BackLight_Configuration();
	LayPower_Configuration();
	Lock_Configuration();
  SwitchID_Configuration();
  Led_Configuration();
  Communication_Configuration();
}
//------------------------------------------------------------------------------

