quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Communication_Configuration(void)
{
	IOT5302Wdef ampIOT5302W;
  //-----------------------------PC接口USART1
  api_usart_dma_configurationNR(ampCommPcPort,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断
  
  //-----------------------------读卡器接口USART3
  ampIOT5302W.Conf.IOT5302WPort.USARTx  = ampCommCardPort;
	ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_PORT	= ampCommCardTxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_Pin	= ampCommCardTxEnPin;
	ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_PORT	= ampCommCardRxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_Pin	= ampCommCardRxEnPin;
	ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_PORT	=	ampCommCardRxEnPort;
	ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_Pin		=	ampCommCardRxEnPin;
  ampIOT5302W.Conf.USART_BaudRate  = ampCommCardBaudRate;
  api_iot5302w_configuration(&ampIOT5302W);
	
  //-----------------------------层板接口USART2
  ampRS485Ly.USARTx  = ampCommLayPort;
  ampRS485Ly.RS485_TxEn_PORT  = ampCommLayTxEnPort;
  ampRS485Ly.RS485_TxEn_Pin   = ampCommLayTxEnPin;
	ampRS485Ly.RS485_RxEn_PORT	=	ampCommLayRxEnPort;
	ampRS485Ly.RS485_RxEn_Pin		=	ampCommLayRxEnPin;
	ampRS485Ly.RS485_CTL_PORT		=	ampCommLayRxEnPort;
	ampRS485Ly.RS485_CTL_Pin		=	ampCommLayRxEnPin;
  api_rs485_dma_configurationNR(&ampRS485Ly,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	
  //-----------------------------副柜接口UART4
  ampRS485Cb.USARTx  					=	ampCommCbPort;
	ampRS485Cb.RS485_TxEn_PORT	=	ampCommCbTxEnPort;
	ampRS485Cb.RS485_TxEn_Pin		=	ampCommCbTxEnPin;
	ampRS485Cb.RS485_RxEn_PORT	=	ampCommCbRxEnPort;
	ampRS485Cb.RS485_RxEn_Pin		=	ampCommCbRxEnPin;
	ampRS485Cb.RS485_CTL_PORT		=	ampCommCbRxEnPort;
	ampRS485Cb.RS485_CTL_Pin		=	ampCommCbRxEnPin;
  //api_rs485_dma_configurationIT(&ampRS485Cb,19200,maxFramesize);	//RS485_DMA配置--中断
	api_rs485_dma_configurationNR(&ampRS485Cb,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
//------------------------------------------------------------------------------

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void SwitchID_Configuration(void)
{
  ampSwitchID.NumOfSW	=	8;
  
  ampSwitchID.SW1_PORT	=	GPIOB;
  ampSwitchID.SW1_Pin	=	GPIO_Pin_9;
  
  ampSwitchID.SW2_PORT	=	GPIOB;
  ampSwitchID.SW2_Pin	=	GPIO_Pin_8;
  
  ampSwitchID.SW3_PORT	=	GPIOB;
  ampSwitchID.SW3_Pin	=	GPIO_Pin_7;
  
  ampSwitchID.SW4_PORT	=	GPIOB;
  ampSwitchID.SW4_Pin	=	GPIO_Pin_6;
  
  ampSwitchID.SW5_PORT	=	GPIOB;
  ampSwitchID.SW5_Pin	=	GPIO_Pin_5;
  
  ampSwitchID.SW6_PORT	=	GPIOB;
  ampSwitchID.SW6_Pin	=	GPIO_Pin_4;
  
  ampSwitchID.SW7_PORT	=	GPIOB;
  ampSwitchID.SW7_Pin	=	GPIO_Pin_3;
  
  ampSwitchID.SW8_PORT	=	GPIOD;
  ampSwitchID.SW8_Pin	=	GPIO_Pin_2;

	api_SwitchId_initialize(&ampSwitchID);						//

  ampsys.sysdata.Cab_Addr  = api_get_SwitchId_data_left(&ampSwitchID)&0x3F;  
  
	//------主柜标志
  if(api_get_SwitchId_data_left(&ampSwitchID)&0x80)
  {
    ampsys.sysdata.MB_Flag=1; //0--副柜，1--主柜
  }
  else
  {
    ampsys.sysdata.MB_Flag=0; //0--副柜，1--主柜
  }
	//------透明屏标志
	if(api_get_SwitchId_data_left(&ampSwitchID)&0x40)
  {
    ampsys.sysdata.Display_Flag=1; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
    ampsys.sysdata.Display_Flag=0; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Configuration(void)
{
  GPIO_Configuration_OPP50(ampBackLightPort,ampBackLightPin);
	GPIO_Configuration_OPP50(ampLcdLightPort,ampLcdLightPin);
	ampsys.BackLight.flag.Level=3;
	ampsys.LcdLight.flag.Level=3;
  //ampBakkLightOff;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void LayPower_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLayPowerPort,ampLayPowerPin);
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lock_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLockDrPort,ampLockDrPin);
  GPIO_Configuration_IPU(ampLockSiPort,ampLockSiPin);
  ampResLock;
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Configuration(void)
{
  stLed.port.SPIx 			= SPI1;
  stLed.port.nss_port  	= GPIOA;
  stLed.port.nss_pin   	= GPIO_Pin_4;
  stLed.port.clk_port 	= GPIOA;
  stLed.port.clk_pin  	= GPIO_Pin_5;
  stLed.port.miso_port  = GPIOA;
  stLed.port.miso_pin   = GPIO_Pin_6;
  stLed.port.mosi_port  = GPIOA;
  stLed.port.mosi_pin   = GPIO_Pin_7;
  stLed.port.SPI_BaudRatePrescaler_x  = SPI_BaudRatePrescaler_64;
	api_spi_configurationNR(&stLed);		//SPI接口配置
  //SPI_InitializeSPI(&stLed);			//SPI-DMA通讯方式配置
}
//------------------------------------------------------------------------------







//--------------------------------static-test
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void test_cabinet_address_none_process(void)		//未拨码柜接口发LCD测试程序
{
	static unsigned char	backlight_flag=0;
	static unsigned char	num=0;
	static unsigned char	address_none_flag=0;
  static unsigned short time=0;
	
